'''
Програма зчитує число, вирішує в які рамки воно підпадає та повідомляє про це користувача. Рамки:

  Число дорівнює або менше ніж -500
  Дорівнює або менше ніж -100, але більше -500
  Менше ніж 0, але більше -100
  Дорівнює або більше ніж 0, але менше 100
  Дорівнює або більше ніж 100, але менше 500
  Дорівнює або більше ніж 500
'''

def determine_number_brackets():
    while True:
        x = float(input('>'))

        if x <= - 500:
            print(f'{x} <= - 500')
        elif x <= -100:
            print(f'-500 < {x} <= - 100')
        elif x < 0:
            print(f'-100 < {x} < 0')
        elif x < 100:
            print(f'0 <= {x} < 100')
        elif x < 500:
            print(f'100 <= {x} < 500')
        else:
            print(f'{x} >= 500')


"""
  Привіт / Хай / Доброго дня => Доброго вечора, я бот з України!
  Як справи? / Що робиш? / Чим займаєшся? => Вчусь програмувати на Python!
  Фільм / Кінотеатр / Серіал => Соррі що втручуюсь, не знаю про що йдеться мова, але подивіться серіал/фільм *ваша відповідь*, він просто бомба!
  Бувай / Надобраніч / Гудбай / До зустрічі => Побачимось у мережі, I'll be back.
Завершити виконання програми
  *Ключових слів не знайдено* => Дуже цікаво, але, нажаль, ніфіга не зрозуміло :( 
  Якщо хочете, можете добавити свої пари теж, але занадто глибоко поки не занурюйтесь - через декілька занять ми зможемо зробити це на більш цікавому рівні, тому не марнуйте час зараз.
  """


def chatbot():
    while True:
        x = input('>').lower()
        # ways to optimize
        hi_keywords = ['привіт', 'хай', 'доброго дня']
        d = {
            'привіт': 'Доброго вечора, я бот з України!',
            'хай': 'Доброго вечора, я бот з України!'
        }
        if 'привіт' in x or 'хай' in x or 'доброго дня' in x:
            print('Доброго вечора, я бот з України!')
        elif 'як справи?' in x or 'що робиш?' in x or 'чим займаєшся?' in x:
            print('Вчусь програмувати на Python!')
        elif 'бувай' in x or 'надобраніч' in x or 'гудбай' in x:
            print('Побачимось у мережі, I\'ll be back.')
            exit(0)
            break
        else:
            print('Дуже цікаво, але, нажаль, ніфіга не зрозуміло :(')

if __name__ == '__main__':
    # determine_number_brackets()
    chatbot()